Show / Hide Table of Contents
Class ParameterDouble
Double parameter of cross-section
Inheritance
System.Object
OpenObject
Parameter
ParameterDouble
Inherited Members
 Parameter.Name
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ParameterDouble : Parameter
Properties
Improve this Doc   View Source
Value
Value
Declaration
public double Value { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source